:PROPERTIES:
:ID:       d25efeb9-f75c-4b96-8af4-a9f9f216d2c4
:END:
#+TITLE: VyOS: Run Stigix
#+CATEGORY: slips
#+TAGS:

** Profiles

+ Setup =.env= and prep a means of pushing to remote nodes
  - disable what's not needed in =.env=
  - document logs/etc for data collection

The =.env= files should be deployable under profiles

#+begin_src shell :results output replace code :wrap verse
echo ./profiles{1,2}/{.env,docker-compose.yml,logs/test-results.jsonl}
    | tr ' ' '\n' | tree -a --fromfile .
#+end_src

#+RESULTS:
#+begin_verse
.
├── profiles1
│   ├── docker-compose.yml
│   ├── .env
│   └── logs
│       └── test-results.jsonl
└── profiles2
    ├── docker-compose.yml
    ├── .env
    └── logs
        └── test-results.jsonl

5 directories, 6 files
#+end_verse

To avoid cloudflare dependency, need to manually handoff the =JWT_SECRET=
(requires =ssh= connectivity between endpoints)

